wrk_rps_merged/342
Running 5m test @ http://10.103.94.209:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 312.212ms, rate sampling interval: 1513ms
  Thread calibration: mean lat.: 321.265ms, rate sampling interval: 1537ms
  Thread calibration: mean lat.: 314.030ms, rate sampling interval: 1503ms
  Thread calibration: mean lat.: 330.991ms, rate sampling interval: 1347ms
  Thread calibration: mean lat.: 339.502ms, rate sampling interval: 1567ms
  Thread calibration: mean lat.: 333.189ms, rate sampling interval: 1516ms
  Thread calibration: mean lat.: 333.389ms, rate sampling interval: 1682ms
  Thread calibration: mean lat.: 343.337ms, rate sampling interval: 1531ms
  Thread calibration: mean lat.: 349.432ms, rate sampling interval: 1544ms
  Thread calibration: mean lat.: 355.978ms, rate sampling interval: 1735ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   521.11ms  308.67ms   3.27s    75.47%
    Req/Sec     9.47      2.66    19.00     86.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  477.70ms
 75.000%  664.06ms
 90.000%  847.36ms
 99.000%    1.67s 
 99.900%    2.44s 
 99.990%    2.98s 
 99.999%    3.28s 
100.000%    3.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.570     0.000000            1         1.00
     178.175     0.100000         2905         1.11
     283.903     0.200000         5824         1.25
     370.943     0.300000         8717         1.43
     444.159     0.400000        11620         1.67
     477.695     0.500000        14509         2.00
     541.695     0.550000        15990         2.22
     559.103     0.600000        17435         2.50
     577.535     0.650000        18876         2.86
     644.095     0.700000        20337         3.33
     664.063     0.750000        21763         4.00
     674.815     0.775000        22514         4.44
     736.767     0.800000        23233         5.00
     747.519     0.825000        23960         5.71
     762.367     0.850000        24678         6.67
     778.751     0.875000        25387         8.00
     836.607     0.887500        25750         8.89
     847.359     0.900000        26109        10.00
     860.671     0.912500        26482        11.43
     872.959     0.925000        26840        13.33
     939.519     0.937500        27197        16.00
     954.879     0.943750        27382        17.78
     968.191     0.950000        27561        20.00
     989.695     0.956250        27740        22.86
    1079.295     0.962500        27925        26.67
    1175.551     0.968750        28103        32.00
    1248.255     0.971875        28199        35.56
    1283.071     0.975000        28284        40.00
    1353.727     0.978125        28376        45.71
    1385.471     0.981250        28468        53.33
    1474.559     0.984375        28556        64.00
    1542.143     0.985938        28603        71.11
    1569.791     0.987500        28648        80.00
    1636.351     0.989062        28692        91.43
    1685.503     0.990625        28738       106.67
    1760.255     0.992188        28784       128.00
    1783.807     0.992969        28806       142.22
    1845.247     0.993750        28828       160.00
    1864.703     0.994531        28851       182.86
    1937.407     0.995313        28874       213.33
    1976.319     0.996094        28896       256.00
    2038.783     0.996484        28908       284.44
    2075.647     0.996875        28919       320.00
    2144.255     0.997266        28931       365.71
    2164.735     0.997656        28944       426.67
    2248.703     0.998047        28955       512.00
    2279.423     0.998242        28959       568.89
    2342.911     0.998437        28964       640.00
    2363.391     0.998633        28970       731.43
    2373.631     0.998828        28977       853.33
    2439.167     0.999023        28981      1024.00
    2449.407     0.999121        28984      1137.78
    2478.079     0.999219        28987      1280.00
    2488.319     0.999316        28990      1462.86
    2553.855     0.999414        28995      1706.67
    2553.855     0.999512        28995      2048.00
    2664.447     0.999561        28997      2275.56
    2686.975     0.999609        28998      2560.00
    2863.103     0.999658        29000      2925.71
    2869.247     0.999707        29001      3413.33
    2887.679     0.999756        29002      4096.00
    2940.927     0.999780        29003      4551.11
    2951.167     0.999805        29004      5120.00
    2953.215     0.999829        29005      5851.43
    2953.215     0.999854        29005      6826.67
    2975.743     0.999878        29006      8192.00
    2975.743     0.999890        29006      9102.22
    3039.231     0.999902        29007     10240.00
    3039.231     0.999915        29007     11702.86
    3039.231     0.999927        29007     13653.33
    3071.999     0.999939        29008     16384.00
    3071.999     0.999945        29008     18204.44
    3071.999     0.999951        29008     20480.00
    3071.999     0.999957        29008     23405.71
    3071.999     0.999963        29008     27306.67
    3276.799     0.999969        29009     32768.00
    3276.799     1.000000        29009          inf
#[Mean    =      521.114, StdDeviation   =      308.671]
#[Max     =     3274.752, Total count    =        29009]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30035 requests in 5.00m, 156.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
  Non-2xx or 3xx responses: 409
Requests/sec:    100.09
Transfer/sec:    534.16KB