wrk_rps_merged/348
Running 5m test @ http://10.104.19.187:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 225.668ms, rate sampling interval: 1057ms
  Thread calibration: mean lat.: 212.702ms, rate sampling interval: 1037ms
  Thread calibration: mean lat.: 227.914ms, rate sampling interval: 943ms
  Thread calibration: mean lat.: 244.761ms, rate sampling interval: 1038ms
  Thread calibration: mean lat.: 219.973ms, rate sampling interval: 938ms
  Thread calibration: mean lat.: 242.068ms, rate sampling interval: 1042ms
  Thread calibration: mean lat.: 248.970ms, rate sampling interval: 1008ms
  Thread calibration: mean lat.: 238.524ms, rate sampling interval: 997ms
  Thread calibration: mean lat.: 226.380ms, rate sampling interval: 1000ms
  Thread calibration: mean lat.: 256.101ms, rate sampling interval: 1020ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   230.02ms  188.10ms   1.60s    71.22%
    Req/Sec     9.49      2.78    19.00     84.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  204.29ms
 75.000%  323.84ms
 90.000%  497.41ms
 99.000%  822.27ms
 99.900%    1.31s 
 99.990%    1.60s 
 99.999%    1.60s 
100.000%    1.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.524     0.000000            1         1.00
      25.759     0.100000         2901         1.11
      53.343     0.200000         5802         1.25
     125.567     0.300000         8710         1.43
     145.407     0.400000        11622         1.67
     204.287     0.500000        14515         2.00
     221.439     0.550000        15963         2.22
     234.879     0.600000        17412         2.50
     257.023     0.650000        18856         2.86
     305.919     0.700000        20323         3.33
     323.839     0.750000        21759         4.00
     333.823     0.775000        22495         4.44
     361.983     0.800000        23209         5.00
     400.895     0.825000        23934         5.71
     411.135     0.850000        24678         6.67
     429.055     0.875000        25385         8.00
     454.911     0.887500        25746         8.89
     497.407     0.900000        26109        10.00
     505.599     0.912500        26477        11.43
     516.607     0.925000        26837        13.33
     538.111     0.937500        27196        16.00
     558.079     0.943750        27379        17.78
     595.455     0.950000        27563        20.00
     603.135     0.956250        27742        22.86
     616.959     0.962500        27926        26.67
     638.463     0.968750        28103        32.00
     649.215     0.971875        28194        35.56
     675.327     0.975000        28284        40.00
     706.559     0.978125        28381        45.71
     719.871     0.981250        28468        53.33
     745.983     0.984375        28556        64.00
     759.807     0.985938        28602        71.11
     800.255     0.987500        28647        80.00
     815.103     0.989062        28694        91.43
     826.879     0.990625        28738       106.67
     841.727     0.992188        28784       128.00
     849.407     0.992969        28806       142.22
     897.535     0.993750        28828       160.00
     904.703     0.994531        28853       182.86
     918.527     0.995313        28874       213.33
     945.663     0.996094        28896       256.00
    1023.487     0.996484        28908       284.44
    1099.775     0.996875        28919       320.00
    1114.111     0.997266        28934       365.71
    1125.375     0.997656        28942       426.67
    1144.831     0.998047        28954       512.00
    1196.031     0.998242        28959       568.89
    1205.247     0.998437        28964       640.00
    1216.511     0.998633        28970       731.43
    1300.479     0.998828        28976       853.33
    1305.599     0.999023        28981      1024.00
    1309.695     0.999121        28984      1137.78
    1343.487     0.999219        28987      1280.00
    1392.639     0.999316        28990      1462.86
    1398.783     0.999414        28993      1706.67
    1399.807     0.999512        28995      2048.00
    1401.855     0.999561        28997      2275.56
    1403.903     0.999609        28998      2560.00
    1495.039     0.999658        29000      2925.71
    1496.063     0.999707        29001      3413.33
    1497.087     0.999756        29002      4096.00
    1500.159     0.999780        29003      4551.11
    1594.367     0.999805        29004      5120.00
    1598.463     0.999829        29005      5851.43
    1598.463     0.999854        29005      6826.67
    1600.511     0.999878        29007      8192.00
    1600.511     0.999890        29007      9102.22
    1600.511     0.999902        29007     10240.00
    1600.511     0.999915        29007     11702.86
    1600.511     0.999927        29007     13653.33
    1602.559     0.999939        29009     16384.00
    1602.559     1.000000        29009          inf
#[Mean    =      230.016, StdDeviation   =      188.097]
#[Max     =     1601.536, Total count    =        29009]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30051 requests in 5.00m, 169.01MB read
Requests/sec:    100.15
Transfer/sec:    576.78KB